scc2425-artillery-tests/benchmark_logs/benchmark_log_targetdesc_Kubernets_Final_test_1_20241214_231919.txt
Running user_register.yaml on http://127.0.0.1/tukano-1/rest
Test run id: tpjkj_fwc55xtadggjwpeptac9wb8m4hftb_9rwn
Phase started: simple_post (index: 0, duration: 20s) 23:19:20(+0000)

--------------------------------------
Metrics for period to: 23:19:30(+0000) (width: 8.914s)
--------------------------------------

http.codes.404: ................................................................ 270
http.downloaded_bytes: ......................................................... 184410
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 270
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 11
  mean: ........................................................................ 3.1
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.responses: ................................................................ 270
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 90
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  90
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  90
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 11
  mean: ........................................................................ 5.1
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 10.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 8
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 6
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 9
  mean: ........................................................................ 2
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 5
vusers.completed: .............................................................. 90
vusers.created: ................................................................ 90
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 90
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6
  max: ......................................................................... 32.9
  mean: ........................................................................ 13.8
  median: ...................................................................... 13.1
  p95: ......................................................................... 20.7
  p99: ......................................................................... 24.8


Phase completed: simple_post (index: 0, duration: 20s) 23:19:40(+0000)

--------------------------------------
Metrics for period to: 23:19:40(+0000) (width: 9.92s)
--------------------------------------

http.codes.404: ................................................................ 300
http.downloaded_bytes: ......................................................... 204900
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 3.3
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.1
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 3.3
  median: ...................................................................... 3
  p95: ......................................................................... 7
  p99: ......................................................................... 13.1
http.responses: ................................................................ 300
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  100
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  100
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 13
  mean: ........................................................................ 5.1
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 10.1
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 2.4
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 19
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 19.1
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.1
  max: ......................................................................... 50.8
  mean: ........................................................................ 13.9
  median: ...................................................................... 12.8
  p95: ......................................................................... 19.5
  p99: ......................................................................... 48.9


--------------------------------------
Metrics for period to: 23:19:50(+0000) (width: 0.907s)
--------------------------------------

http.codes.404: ................................................................ 30
http.downloaded_bytes: ......................................................... 20490
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 30
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2.1
  median: ...................................................................... 1
  p95: ......................................................................... 5
  p99: ......................................................................... 5
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 6
  mean: ........................................................................ 2.1
  median: ...................................................................... 1
  p95: ......................................................................... 5
  p99: ......................................................................... 5
http.responses: ................................................................ 30
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 10
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  10
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  10
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 6
  mean: ........................................................................ 3.6
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 5
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.3
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 3
  mean: ........................................................................ 1.5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 3
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6.7
  max: ......................................................................... 14.6
  mean: ........................................................................ 9.7
  median: ...................................................................... 9.5
  p95: ......................................................................... 13.1
  p99: ......................................................................... 13.1


All VUs finished. Total time: 21 seconds

--------------------------------
Summary report @ 23:19:42(+0000)
--------------------------------

http.codes.404: ................................................................ 600
http.downloaded_bytes: ......................................................... 409800
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 3.1
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.response_time.4xx:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 3.1
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.1
http.responses: ................................................................ 600
plugins.metrics-by-endpoint./tukano-1/rest/users/.codes.404: ................... 200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}....  200
plugins.metrics-by-endpoint./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}.c...  200
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/:
  min: ......................................................................... 2
  max: ......................................................................... 13
  mean: ........................................................................ 5
  median: ...................................................................... 5
  p95: ......................................................................... 7.9
  p99: ......................................................................... 10.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 22
  mean: ........................................................................ 2.3
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
plugins.metrics-by-endpoint.response_time./tukano-1/rest/users/{{ userId}}?pwd={{ pwd }}:
  min: ......................................................................... 1
  max: ......................................................................... 19
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 8.9
vusers.completed: .............................................................. 200
vusers.created: ................................................................ 200
vusers.created_by_name.TuKanoWholeUserFlow: .................................... 200
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 6
  max: ......................................................................... 50.8
  mean: ........................................................................ 13.6
  median: ...................................................................... 12.8
  p95: ......................................................................... 19.9
  p99: ......................................................................... 32.8

==================================================

Running upload_shorts.yaml on http://127.0.0.1/tukano-1/rest
Test run id: tp4t8_ycmxx9reffxgtfw49fg8enf9jj7rg_qgbj
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 23:19:44(+0000)

worker error, id: 1 SyntaxError [Error]: Unexpected token '<', "<!doctype "... is not valid JSON
    at JSON.parse (<anonymous>)
    at processVideoAddReply (/Users/oliveira/Documents/Cloud/scc2425/scc2425-artillery-tests/test-utils.js:214:35)
    at iteratee (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:655:21)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3113:16
    at replenish (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1014:17)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1019:9
    at eachLimit$1 (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3199:24)
    at Object.<anonymous> (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1049:16)
    at captured (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:636:21)
    at Object.captureOrMatch (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-commons/engine_util.js:399:12)
Error: 

==================================================

Running realistic_flow.yaml on http://127.0.0.1/tukano-1/rest
Test run id: t776h_ymbk4yt5e66jyd8zxrwkyc8w7dxt6_8r6p
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 23:19:47(+0000)

worker error, id: 1 SyntaxError [Error]: Unexpected token '<', "<!doctype "... is not valid JSON
    at JSON.parse (<anonymous>)
    at processVideoGetReply (/Users/oliveira/Documents/Cloud/scc2425/scc2425-artillery-tests/test-utils.js:230:35)
    at iteratee (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:655:21)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3113:16
    at replenish (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1014:17)
    at /opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1019:9
    at eachLimit$1 (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:3199:24)
    at Object.<anonymous> (/opt/homebrew/lib/node_modules/artillery/node_modules/async/dist/async.js:1049:16)
    at captured (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-core/lib/engine_http.js:636:21)
    at Object.captureOrMatch (/opt/homebrew/lib/node_modules/artillery/node_modules/@artilleryio/int-commons/engine_util.js:399:12)
Error: 

==================================================